app/Http/Controllers/IssuesController.php

select * from `comments` where `comments`.`issue_id` in (12, 13, 14, 15, 16)
select * from `issues` order by `created_at` desc limit 5 offset 0
select * from `users` where `users`.`id` in (1)
select count(*) as aggregate from `issues`
---
    public function index()
    {
        $issues = Issue::with('user','comments')
            ->orderBy('created_at', 'desc')
            ->paginate(5);

select * from `comments` where `comments`.`issue_id` = 16 and `comments`.`issue_id` is not null
select * from `users` where `users`.`id` in (1, 2)
---
    public function show(Issue $issue)
    {
//        $content = Markdown::convertToHtml($issue->content);
        $comments = $issue->comments()->with('user')->get();

update `issues` set `title` = '121', `content` = '112', `issues`.`updated_at` = '2019-10-09 21:18:10' where `id` = 16
---
    public function update(UpdateIssue $request, Issue $issue)
    {
        $issue->update($request->all());