app/Http/Controllers/WelcomeController.php

    public function index()
    {
    	$issues = Issue::with('user', 'comments')
            ->orderBy('created_at','desc')
    		->take(5)
    		->get();
---
select * from `comments` where `comments`.`issue_id` in (8, 12, 13, 14, 15)
select * from `issues` order by `created_at` desc limit 5
select * from `users` where `users`.`id` in (1, 8)